_Rarzrabotki/Rarus/USO2/Documents/СМ_ЗаявкаНаМатериал.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.13">
	<Document>
		<Properties>
			<Name>СМ_ЗаявкаНаМатериал</Name>
			<Posting>Deny</Posting>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Автор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаОтправки</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДокументОснование</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.СМ_АктВыполненныхРабот</v8:Type>
						<v8:Type>cfg:DocumentRef.СМ_ЛокальнаяСмета</v8:Type>
						<v8:Type>cfg:DocumentRef.СМ_ПозицияЛокальнойСметы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Проект</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СМ_ОбъектыСтроительства</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЕдиницаИзмерения</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СМ_ЕдиницыИзмеренияСмета</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПолноеНаименование</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>300</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИсторияСообщений</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТребуетУточнения</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КоличествоУточнений</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>3</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ГруппаРесурсов</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СМ_Ресурсы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Материалы</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Код</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>25</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Наименование</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:Type>cfg:CatalogRef.СМ_Ресурсы</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Смета</Name>
							<Type>
								<v8:Type>cfg:DocumentRef.СМ_АктВыполненныхРабот</v8:Type>
								<v8:Type>cfg:DocumentRef.СМ_ЛокальнаяСмета</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Позиция</Name>
							<Type>
								<v8:Type>cfg:DocumentRef.СМ_ПозицияЛокальнойСметы</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПолноеНаименование</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>300</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЕдиницаИзмерения</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.СМ_ЕдиницыИзмеренияСмета</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НеОтноситсяКМатериалам</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЕстьСметныйКод</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Группа</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.СМ_Ресурсы</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

_Rarzrabotki/Rarus/USO2/InformationRegisters/СМ_ОтветственныеЛица.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.13">
	<InformationRegister>
		<Properties>
			<Name>СМ_ОтветственныеЛица</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ДатаОкончания</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Пользователь</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ДатаНачала</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

_Rarzrabotki/Rarus/USO2/Enums/СМ_ВидыРесурсов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.13">
	<Enum>
		<Properties>
			<Name>СМ_ВидыРесурсов</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ЗатратыТрудаРабочих</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЗатратыТрудаМашинистов</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>МашиныИМеханизмы</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Материалы</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Справочно</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Оборудование</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Перебазировка</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Транспортировка</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

_Rarzrabotki/Rarus/USO2/Enums/СМ_ГодыВыпускаБазы.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.13">
	<Enum>
		<Properties>
			<Name>СМ_ГодыВыпускаБазы</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>г1984</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>г1991</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>г2001</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>г2009</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>г2017</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

_Rarzrabotki/Rarus/USO2/Enums/ТипыКонтактнойИнформации.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.13">
	<Enum>
		<Properties>
			<Name>ТипыКонтактнойИнформации</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Адрес</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Телефон</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>АдресЭлектроннойПочты</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Skype</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВебСтраница</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Факс</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Другое</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

_Rarzrabotki/Rarus/USO2/Catalogs/СМ_Ресурсы.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.13">
	<Catalog>
		<Properties>
			<Name>СМ_Ресурсы</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ВидРесурса</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СМ_ВидыРесурсов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ГодВыпуска</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СМ_ГодыВыпускаБазы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДлинноеНаименование</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЕдиницаИзмерения</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СМ_ЕдиницыИзмеренияСмета</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КлассГруза</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>1</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КодОКП</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>МассаБрутто</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>5</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>МассаНетто</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>5</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ГруппаРесурсов</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СМ_ГруппыРесурсов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Разряд</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>4</v8:Digits>
							<v8:FractionDigits>1</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КодОКДП2</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>9</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВводитьСтоимостьНаОбъем</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ДополнительныеРеквизиты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Свойство</Name>
							<Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.ДополнительныеРеквизитыИСведения</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТекстоваяСтрока</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

_Rarzrabotki/Rarus/USO2/Documents/СМ_ЗаявкаНаМатериал/Forms/ФормаДокументаНовая/Ext/Form/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ЗаявкаИзменена = Ложь;
	Если Объект.Материалы.Количество() = 0 Тогда
		НоваяСтрока = Объект.Материалы.Добавить();
	Иначе
		НоваяСтрока = Объект.Материалы[0];
	КонецЕсли; 
	Если Не ЗначениеЗаполнено(Объект.Ответственный) Тогда
		Объект.Ответственный = ПолучитьОтветственного();
	КонецЕсли;
	
	УстановитьДоступностьЭлементовНаСервере();
	
КонецПроцедуры

&НаСервере          
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	Если Не ЗначениеЗаполнено(Объект.Автор) Тогда
		Объект.Автор = ПолучитьТекущегоПользователя();
	КонецЕсли; 
	Если Не ЗначениеЗаполнено(ТекущийОбъект.Ответственный) Тогда
		ТекущийОбъект.Ответственный = ПолучитьОтветственного();
	КонецЕсли; 
	Если ТекущийОбъект.Материалы.Количество() = 1 Тогда
		Если ТекущийОбъект.Материалы[0].ЕстьСметныйКод Тогда
			ОтправитьСообщение(НСтр("ru='Ресурс есть в справочнике материалов 1С'"));
		КонецЕсли;
		Если ТекущийОбъект.Материалы[0].НеОтноситсяКМатериалам Тогда
			ОтправитьСообщение(НСтр("ru='Ресурс не относится к строительным материалам'"));
		КонецЕсли;
	КонецЕсли; 
	Если ЗначениеЗаполнено(Объект.Ссылка) Тогда
		Если ТекущийОбъект.ПолноеНаименование <> Объект.Ссылка.ПолноеНаименование
			ИЛИ ТекущийОбъект.ГруппаРесурсов <> Объект.Ссылка.ГруппаРесурсов 
			ИЛИ ТекущийОбъект.ЕдиницаИзмерения <> Объект.Ссылка.ЕдиницаИзмерения 
			ИЛИ ТекущийОбъект.Проект <> Объект.Ссылка.Проект Тогда
			ЗаявкаИзменена = Истина;	
		КонецЕсли; 
	КонецЕсли; 
	
КонецПроцедуры

&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)
	
	Если ЗаявкаИзменена Тогда
		ОтправитьСообщение(НСтр("ru='Исходные данные заявки были изменены'"));
	КонецЕсли;
	УстановитьДоступностьЭлементовНаСервере();
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ЕстьСметныйКод_НеОтноситсяКМатериаламПриИзменении(Элемент)
	Если Объект.Материалы.Количество() = 1 Тогда
		УстановитьДоступностьМатериалов(Не (Объект.Материалы[0].ЕстьСметныйКод ИЛИ Объект.Материалы[0].НеОтноситсяКМатериалам));
	Иначе
		УстановитьДоступностьМатериалов(Ложь);
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура МатериалыНаименованиеСправочникаПриИзменении(Элемент)
	ДлинноеНаименование = ВернутьДлинноеНаименование();
	Если ДлинноеНаименование <> "" Тогда
		Если Элемент.ТекстРедактирования <> ДлинноеНаименование Тогда
			ОбработкаВыбораМатериалаНаСервере("ОчиститьСсылку");
			Объект.Материалы[0].Код = ПолучитьНовыйКод();
			УстановитьДоступностьМатериаловПриВыбореРесурса();
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура МатериалыНаименованиеСправочникаНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	ОткрытьФорму("Справочник.СМ_Ресурсы.Форма.ФормаВыбора",, Элемент);
КонецПроцедуры

&НаКлиенте
Процедура МатериалыНаименованиеСправочникаОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	 ОбработкаВыбораМатериалаНаСервере(ВыбранноеЗначение);
	 УстановитьДоступностьМатериаловПриВыбореРесурса();
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура СкопироватьПолноеНаименование(Команда)
	
	СкопироватьПолноеНаименованиеНаСервере();
	
КонецПроцедуры

&НаКлиенте
Процедура ПрисвоитьКод(Команда)
	
	Если Объект.Материалы.Количество() = 1 Тогда
		Объект.Материалы[0].Код = ПолучитьНовыйКод();
	КонецЕсли;	
	
КонецПроцедуры

&НаКлиенте
Процедура Отправить(Команда)
	
	ОтправитьНаСервере();
	
КонецПроцедуры

&НаКлиенте
Процедура ОтправитьЗапрос(Команда)
	
	Если Не ПроверитьЗаполнениеРеквизитовШапки() Тогда
	    Сообщение = Новый СообщениеПользователю();
	    Сообщение.Текст = НСтр("ru = 'Проверьте заполнение реквизитов шапки'");
	    Сообщение.Сообщить();
		Возврат;
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(Объект.Автор) Тогда
		Объект.Автор = ПолучитьТекущегоПользователя();
	КонецЕсли; 
	
	ОтправитьСообщение(НСтр("ru='Отправлен запрос на добавление ресурса в базу 1С'"));
	Элементы.КомандыОбработкиЗапроса.ПодчиненныеЭлементы.ОтправитьЗапрос.Доступность = Ложь;
	Записать();
	
КонецПроцедуры

&НаКлиенте
Процедура Добавить(Команда)
	
	Если Объект.Материалы.Количество() = 1 Тогда
		ТекСтрокаМатериалы = Объект.Материалы[0];
		Если ЗначениеЗаполнено(ТекСтрокаМатериалы.ПолноеНаименование) Тогда
			Если ЗначениеЗаполнено(ТекСтрокаМатериалы.Группа) Тогда
				Если ЗначениеЗаполнено(ТекСтрокаМатериалы.ЕдиницаИзмерения) Тогда
					Если ЗначениеЗаполнено(ТекСтрокаМатериалы.Код) Тогда
						Если Не ПроверитьЗаполнениеРеквизитовШапки() Тогда
						    Сообщение = Новый СообщениеПользователю();
						    Сообщение.Текст = НСтр("ru = 'Проверьте заполнение реквизитов шапки'");
						    Сообщение.Сообщить();
							Возврат;
						КонецЕсли;
						СоздатьНовыйРесурс();
						//Элементы.КомандыОбработкиЗапроса.ПодчиненныеЭлементы.Добавить.Доступность = Ложь;
					Иначе
					    Сообщение = Новый СообщениеПользователю();
					    Сообщение.Текст = НСтр("ru = 'Не указан сметный код!'");
					    Сообщение.Сообщить();
					КонецЕсли; 
				Иначе
				    Сообщение = Новый СообщениеПользователю();
				    Сообщение.Текст = НСтр("ru = 'Не указана единица измерения!'");
				    Сообщение.Сообщить();
				КонецЕсли; 
			Иначе
			    Сообщение = Новый СообщениеПользователю();
			    Сообщение.Текст = НСтр("ru = 'Не указана группа!'");
			    Сообщение.Сообщить();
			КонецЕсли; 
		Иначе
		    Сообщение = Новый СообщениеПользователю();
		    Сообщение.Текст = НСтр("ru = 'Не указано полное наименование!'");
		    Сообщение.Сообщить();
		КонецЕсли; 
	КонецЕсли; 
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура УстановитьДоступностьЭлементовНаСервере()
	
	Элементы.КомандыОбработкиЗапроса.ПодчиненныеЭлементы.ОтправитьЗапрос.Доступность = Не ЗначениеЗаполнено(Объект.Автор);
	УстановитьДоступностьШапки(Не ЗначениеЗаполнено(Объект.Автор));
	ПроверкаЗаполненияРеквизитов = ПроверитьЗаполнениеРеквизитов();
	Если ПроверкаЗаполненияРеквизитов Тогда
		Элементы.ГруппаОбработкаЗапроса.Доступность	= Ложь;
		Элементы.КомандыОбработкиЗапроса.ПодчиненныеЭлементы.Записать.Доступность = Ложь;
		УстановитьДоступностьДобавить(Ложь);
	Иначе
		ИмеетПраво = ПроверитьДоступностьРолей();
		Элементы.ГруппаОбработкаЗапроса.Доступность	= ИмеетПраво;
		Элементы.КомандыОбработкиЗапроса.ПодчиненныеЭлементы.Записать.Доступность = ИмеетПраво;
		УстановитьДоступностьДобавить(ИмеетПраво);
	КонецЕсли;
	
КонецПроцедуры

Процедура УстановитьДоступностьШапки(ШапкаДоступность = Истина)
	Элементы.ГруппаНомерИДата.Доступность				= ШапкаДоступность;
	Элементы.ПолноеНаименование.Доступность				= ШапкаДоступность;
	Элементы.ГруппаРесурсов.Доступность					= ШапкаДоступность;
	Элементы.ГруппаЕдиницаИзмеренияИПроект.Доступность	= ШапкаДоступность;
КонецПроцедуры

Функция ПроверитьДоступностьРолей()
	Возврат РольДоступна("СМ_АдминистраторСмета") ИЛИ РольДоступна("ПолныеПрава") ИЛИ ПараметрыСеанса.ТекущийПользователь = Объект.Ответственный;
КонецФункции

Функция ПроверитьЗаполнениеРеквизитов()
	Возврат (ЗначениеЗаполнено(Объект.Материалы[0].Наименование) И ТипЗнч(Объект.Материалы[0].Наименование) = Тип("СправочникСсылка.СМ_Ресурсы"))
			ИЛИ (Объект.Материалы[0].ЕстьСметныйКод ИЛИ Объект.Материалы[0].НеОтноситсяКМатериалам);
КонецФункции

&НаСервере
Функция ПроверитьЗаполнениеРеквизитовШапки()
	Возврат ЗначениеЗаполнено(Объект.ПолноеНаименование) И ЗначениеЗаполнено(Объект.ГруппаРесурсов)
			 И ЗначениеЗаполнено(Объект.ЕдиницаИзмерения) И ЗначениеЗаполнено(Объект.Проект);
КонецФункции

Функция УстановитьДоступностьМатериалов(МатериалыДоступность)
	Элементы.МатериалыНаименованиеСправочника.Доступность													= МатериалыДоступность;
	Элементы.ГруппаНаименованиеСправочника.ПодчиненныеЭлементы.СкопироватьПолноеНаименование.Доступность	= МатериалыДоступность;
	Элементы.МатериалыПолноеНаименование.Доступность														= МатериалыДоступность;
	Элементы.МатериалыГруппа.Доступность																	= МатериалыДоступность;
	Элементы.МатериалыЕдиница.Доступность																	= МатериалыДоступность;
	Элементы.МатериалыКод1.Доступность																		= МатериалыДоступность;
	Элементы.ГруппаСметныйКод.ПодчиненныеЭлементы.ПрисвоитьКод.Доступность									= МатериалыДоступность;
	Элементы.КомандыОбработкиЗапроса.ПодчиненныеЭлементы.Добавить.Доступность								= МатериалыДоступность;
КонецФункции

Функция УстановитьДоступностьМатериаловПриВыбореРесурса()
	МатериалыДоступность = НЕ ПроверитьЗаполнениеРеквизитов();
	Элементы.МатериалыНаименованиеСправочника.Доступность													= Истина;
	Элементы.МатериалыПолноеНаименование.Доступность														= МатериалыДоступность;
	Элементы.МатериалыГруппа.Доступность																	= МатериалыДоступность;
	Элементы.МатериалыЕдиница.Доступность																	= МатериалыДоступность;
	Элементы.МатериалыКод1.Доступность																		= МатериалыДоступность;
	Элементы.МатериалыЕстьСметныйКод.Доступность															= МатериалыДоступность;
	Элементы.МатериалыНеОтноситсяКМатериалам.Доступность													= МатериалыДоступность;
	Элементы.ГруппаСметныйКод.ПодчиненныеЭлементы.ПрисвоитьКод.Доступность									= МатериалыДоступность;
	Элементы.КомандыОбработкиЗапроса.ПодчиненныеЭлементы.Добавить.Доступность								= МатериалыДоступность;
КонецФункции

Функция УстановитьДоступностьДобавить(ДоступностьКоманды = Неопределено)
	Если ДоступностьКоманды = Неопределено Тогда
		Элементы.КомандыОбработкиЗапроса.ПодчиненныеЭлементы.Добавить.Доступность = Не ПроверитьЗаполнениеРеквизитов();
	Иначе
		Элементы.КомандыОбработкиЗапроса.ПодчиненныеЭлементы.Добавить.Доступность = ДоступностьКоманды;
	КонецЕсли;
КонецФункции

Функция ПолучитьОтветственного()
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	СМ_ОтветственныеЛица.Пользователь КАК Пользователь
				   |ИЗ	
				   |	РегистрСведений.СМ_ОтветственныеЛица КАК СМ_ОтветственныеЛица
				   |	ВНУТРЕННЕЕ СОЕДИНЕНИЕ (ВЫБРАТЬ	
				   //|			ОтветственныеЛица.Организация,
				   |			МАКСИМУМ(СМ_ОтветственныеЛица.ДатаНачала) КАК ДатаНачала
	               |		ИЗ
	               |			РегистрСведений.СМ_ОтветственныеЛица КАК СМ_ОтветственныеЛица
				   //|		ГДЕ
				   //|			СМ_ОтветственныеЛица.Организация = &Организация
				   //|		СГРУППИРОВАТЬ ПО 
				   //|			ОтветственныеЛица.Организация
				   |	) КАК ВложенныйЗапрос
				   //|	ПО СМ_ОтветственныеЛица.Организация = ВложенныйЗапрос.Организация
				   |	ПО СМ_ОтветственныеЛица.ДатаНачала = ВложенныйЗапрос.ДатаНачала
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	СМ_ОтветственныеЛица.Пользователь";
	//Запрос.УстановитьПараметр("Организация", Организация);	
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		Возврат Выборка.Пользователь;
	Иначе
		Возврат Справочники.Пользователи.ПустаяСсылка();
	КонецЕсли; 
КонецФункции // ()

&НаСервереБезКонтекста
Функция ПолучитьТекущегоПользователя()
	Возврат ПараметрыСеанса.ТекущийПользователь;
КонецФункции // ()

&НаСервере
Функция ВернутьДлинноеНаименование()
	Если ЗначениеЗаполнено(Объект.Материалы[0].Наименование) Тогда
		Если ТипЗнч(Объект.Материалы[0].Наименование) = Тип("СправочникСсылка.СМ_Ресурсы") Тогда
			Возврат Объект.Материалы[0].Наименование.ДлинноеНаименование;
		Иначе
			Возврат Объект.Материалы[0].Наименование;
		КонецЕсли;
	Иначе
		Возврат "";
	КонецЕсли;
КонецФункции

&НаСервере
Процедура СкопироватьПолноеНаименованиеНаСервере()
	Объект.Материалы[0].ПолноеНаименование = Объект.ПолноеНаименование;
	Если ЗначениеЗаполнено(Объект.Материалы[0].Наименование) И ТипЗнч(Объект.Материалы[0].Наименование) = Тип("СправочникСсылка.СМ_Ресурсы") Тогда
		ОбработкаВыбораМатериалаНаСервере("ОчиститьСсылку");
		Объект.Материалы[0].Код = ПолучитьНовыйКод();
		УстановитьДоступностьМатериаловПриВыбореРесурса();
	КонецЕсли;
КонецПроцедуры

Функция ПолучитьНовыйКод()
	Если Объект.Материалы.Количество() = 1 Тогда 
		ТекСтрока = Объект.Материалы[0];
		//Если ЗначениеЗаполнено(Объект.Проект) Тогда
		//	ПрефиксКода = Объект.Проект.Код + "-" + ТекСтрока.Группа.Код + "-";
		//Иначе
		ПрефиксКода = ТекСтрока.Группа.Код + "-";		
		//КонецЕсли; 
		Запрос = Новый Запрос;
		Запрос.Текст = "ВЫБРАТЬ
		               |	МАКСИМУМ(СМ_Ресурсы.Код) КАК Код
		               |ИЗ
		               |	Справочник.СМ_Ресурсы КАК СМ_Ресурсы
		               |ГДЕ
		               |	СМ_Ресурсы.Ссылка В ИЕРАРХИИ(&Группа)
		               |	И СМ_Ресурсы.Код ПОДОБНО &Код";
		Запрос.УстановитьПараметр("Код", ПрефиксКода + "%");
		Запрос.УстановитьПараметр("Группа", ТекСтрока.Группа);
		МассивКодовВГруппе = ПолучитьМассивКодовВГруппе(ТекСтрока.Группа);
		Выборка = Запрос.Выполнить().Выбрать();
		Если Выборка.Следующий() Тогда
			Если СтрДлина(Выборка.Код) >= 4 Тогда
				Попытка
					ТекКод = Число(Прав(Выборка.Код, 4));
				Исключение
					Возврат "";
				КонецПопытки;
				Если ЗначениеЗаполнено(Объект.Проект) Тогда
					ТекКод = ТекКод + 1;
				Иначе
					ТекКодПерем = ТекКод;
					ТекКодНайденный = ТекКод;
					Для Индекс = 1 По ТекКод - 1 Цикл
					    ТекКодПерем = ТекКод - Индекс;					
						ТекКодПеремСтрока = ПрефиксКода + Лев("0000", 4 - СтрДлина(Строка(ТекКодПерем))) + Строка(Формат(ТекКодПерем,"ЧГ=0"));
						Если МассивКодовВГруппе.Найти(ТекКодПеремСтрока) = Неопределено Тогда
							ТекКодНайденный = ТекКодПерем;
							Прервать;
						КонецЕсли; 
					КонецЦикла; 
					Если ТекКодНайденный = ТекКод Тогда
						ТекКод 	= ТекКод + 1;
					    Сообщение = Новый СообщениеПользователю();
					    Сообщение.Текст = НСтр("ru = 'Свободных кодов в группе нет! Уточните назначенный код вручную'");
					    Сообщение.Сообщить();
					Иначе
						ТекКод = ТекКодНайденный;
					КонецЕсли; 
				КонецЕсли;
				ТекКодСтрока = Строка(Формат(ТекКод,"ЧГ=0"));
				Возврат ПрефиксКода + Лев("0000", 4 - СтрДлина(ТекКодСтрока)) + ТекКодСтрока;
			Иначе
				Возврат ПрефиксКода + "0001";	
			КонецЕсли; 
		Иначе
		    Возврат ПрефиксКода + "0001";
		КонецЕсли; 
	КонецЕсли;
	Возврат "";
КонецФункции // ()

Процедура ОтправитьНаСервере()
	ОтправитьСообщение(Сообщение);
	Если Объект.Материалы.Количество() = 1 Тогда
		ТекСтрокаМатериалы = Объект.Материалы[0];
		Если Не ЗначениеЗаполнено(ТекСтрокаМатериалы.Наименование) Тогда
			Объект.ТребуетУточнения = Не Объект.ТребуетУточнения;
			Если Объект.ТребуетУточнения Тогда
				Объект.КоличествоУточнений = Объект.КоличествоУточнений + 1;
			КонецЕсли; 
		КонецЕсли; 
	КонецЕсли; 
	Записать();
КонецПроцедуры

Процедура ОтправитьСообщение(ТекстСообщения)
	Объект.ИсторияСообщений = Объект.ИсторияСообщений + Символы.ПС + Символы.ВК 
								+ Строка(ТекущаяДата()) + " " + Строка(ПараметрыСеанса.ТекущийПользователь) + ": " + ТекстСообщения;
	Если Объект.Ответственный <> ПараметрыСеанса.ТекущийПользователь Тогда
		ОтправитьПисьмо(ПолучитьАдресЭПизПользователя(Объект.Ответственный), НСтр("ru='Заявка на внесение материала в фирменный каталог №'") + Объект.Номер + " от " + Строка(Объект.Дата), Строка(ТекущаяДата()) + " " + Строка(ПараметрыСеанса.ТекущийПользователь) + ": " + ТекстСообщения);
	Иначе
		ОтправитьПисьмо(ПолучитьАдресЭПизПользователя(Объект.Автор), НСтр("ru='Заявка на внесение материала в фирменный каталог №'") + Объект.Номер + " от " + Строка(Объект.Дата), Строка(ТекущаяДата()) + " " + Строка(ПараметрыСеанса.ТекущийПользователь) + ": " + ТекстСообщения);
	КонецЕсли; 
КонецПроцедуры

Процедура СоздатьНовыйРесурс()
	НачатьТранзакцию();
	Попытка
		Записать();
		СоздатьНовыйРесурс_();
	    Сообщение = Новый СообщениеПользователю();
	    Сообщение.Текст = НСтр("ru = 'Ресурс cоздан'");
	    Сообщение.Сообщить();
		ЗафиксироватьТранзакцию();
		Записать();
		ОтправитьЗапросWeb();
	Исключение
	    Сообщение = Новый СообщениеПользователю();
	    Сообщение.Текст = НСтр("ru = 'Отмена транзакции'");
	    Сообщение.Сообщить();
		ОтменитьТранзакцию();
	КонецПопытки;
КонецПроцедуры

Процедура СоздатьНовыйРесурс_()
	
	ТекСтрока = Объект.Материалы[0];
	
	ПользовательИнформационнойБазы = Обработки.НастройкиПользователей.ИмяПользователяИБ(Пользователи.ТекущийПользователь());
	
	СписокНастроек	= СМ_СметаВызовСервера.ПолучитьСписокНастроек();
	
	Для каждого КлючИЗначение из СписокНастроек Цикл
		
		Если КлючИЗначение.Ключ = "НСИ_ГруппаРесурсов" Тогда
			ГруппаРесурсов = ОбщегоНазначения.ХранилищеОбщихНастроекЗагрузить("НастройкиПользователяСмета",
								КлючИЗначение.Ключ,КлючИЗначение.Значение.ЗначениеПоУмолчанию,,ПользовательИнформационнойБазы);
		КонецЕсли;
		
		Если КлючИЗначение.Ключ = "НСИ_КлассГруза" Тогда
			КлассГруза = ОбщегоНазначения.ХранилищеОбщихНастроекЗагрузить("НастройкиПользователяСмета",
								КлючИЗначение.Ключ,КлючИЗначение.Значение.ЗначениеПоУмолчанию,,ПользовательИнформационнойБазы);
		КонецЕсли;
		
	КонецЦикла;
	
	РесурсОбъект = Справочники.СМ_Ресурсы.СоздатьЭлемент();
	РесурсОбъект.Код = ТекСтрока.Код;
	РесурсОбъект.ВидРесурса = Перечисления.СМ_ВидыРесурсов.Материалы;
	РесурсОбъект.Наименование = Строка(ТекСтрока.ПолноеНаименование);
	РесурсОбъект.ДлинноеНаименование = Строка(ТекСтрока.ПолноеНаименование);
	РесурсОбъект.ЕдиницаИзмерения = ТекСтрока.ЕдиницаИзмерения;
	РесурсОбъект.Родитель = ТекСтрока.Группа;
	РесурсОбъект.ГруппаРесурсов = ГруппаРесурсов;
	РесурсОбъект.КлассГруза = КлассГруза;
	РесурсОбъект.ГодВыпуска = Перечисления.СМ_ГодыВыпускаБазы.г2017;
	РесурсОбъект.Записать();
	//Элементы.МатериалыНаименованиеСправочника.СписокВыбора.Добавить(РесурсОбъект.Ссылка);
	ТекСтрока.Наименование = РесурсОбъект.Ссылка;
	ОтправитьСообщение(НСтр("ru='Ресурс добавлен в базу 1С "+Символы.ПС+"Код: "+ТекСтрока.Код+Символы.ПС+"Наименование: "+Строка(ТекСтрока.ПолноеНаименование)+"'"));
	
КонецПроцедуры

Процедура ОтправитьЗапросWeb()
	
	ТекСтрока = Объект.Материалы[0];
	СМ_WS_ВызовСервера.СМ_WS_ВыгрузитьНовыйРесурс(ТекСтрока.Наименование);
	ОтправитьСозданиеНовогоРесурсаНаВебСервер(Строка(ТекСтрока.Наименование), Строка(ТекСтрока.Код), Строка(ТекСтрока.Группа), Строка(ТекСтрока.ЕдиницаИзмерения), Ложь);
	//Результат = ОтправитьСозданиеНовогоРесурсаНаВебСервер(Строка(ТекСтрока.Наименование), Строка(ТекСтрока.Код), Строка(ТекСтрока.Группа), Строка(ТекСтрока.ЕдиницаИзмерения), Ложь);

КонецПроцедуры

// Отправляет на веб-сервис запрос на создание нового ресурса. 
// 
// Параметры:
//		Name - наименование нового ресурса.
//		BudgetCode - сметный код нового ресурса.
//		GroupName - наименование родителя (группы) нового ресурса.
//		UnitName - наименование единицы измерения нового ресурса.
//		DeletionMark - пометка удаления ресурса.
// 
// Возвращаемое значение:
//		Строка - результат отправки нового ресурса.
//
Функция ОтправитьСозданиеНовогоРесурсаНаВебСервер(Name, BudgetCode, GroupName, UnitName, DeletionMark)
	ИмяСервера = Константы.СМ_ВебСервисНСИ.Получить();
	Логин = Константы.СМ_ЛогинВебСервисаНСИ.Получить();
	Пароль = Константы.СМ_ПарольВебСервисаНСИ.Получить();
	Если ИмяСервера <> Неопределено И Логин <> Неопределено И Пароль <> Неопределено Тогда
		Если ЗначениеЗаполнено(ИмяСервера) И ЗначениеЗаполнено(Логин) И ЗначениеЗаполнено(Пароль) Тогда
			НТТР = Новый HTTPСоединение(ИмяСервера,,Логин, Пароль); 
			HTTPЗапрос = Новый HTTPЗапрос("/hs/Smeta/Nomenclature");
			HTTPЗапрос.Заголовки.Вставить("Content-Type","application/json; charset=utf-8"); 

			ЗаписьДжейсон = Новый ЗаписьJSON;
			ЗаписьДжейсон.ПроверятьСтруктуру = Истина;
			ЗаписьДжейсон.УстановитьСтроку();
			СтруктураОбъекта = Новый Структура();
			СтруктураОбъекта.Вставить("Name", Name);
			СтруктураОбъекта.Вставить("BudgetCode", BudgetCode);
			СтруктураОбъекта.Вставить("GroupName", GroupName);
			СтруктураОбъекта.Вставить("UnitName", UnitName);
			СтруктураОбъекта.Вставить("DeletionMark", DeletionMark);
			ЗаписатьJSON(ЗаписьДжейсон,СтруктураОбъекта);
			СтрокаОтвета = ЗаписьДжейсон.Закрыть();
			HTTPЗапрос.УстановитьТелоИзСтроки(СтрокаОтвета, КодировкаТекста.UTF8, ИспользованиеByteOrderMark.НеИспользовать);
			HTTPОтвет = НТТР.ОтправитьДляОбработки(HTTPЗапрос);
			ОтветДжейсон = HTTPОтвет.ПолучитьТелоКакСтроку();
			ЧтениеJSON = Новый ЧтениеJSON;
			ЧтениеJSON.УстановитьСтроку(ОтветДжейсон);
			СтруктураРезультат = ПрочитатьJSON(ЧтениеJSON);
			Если СтруктураРезультат.success Тогда
				Возврат "";
			Иначе
				Возврат СтруктураРезультат.message;
			КонецЕсли;
		КонецЕсли; 
	КонецЕсли; 
	Возврат "";
КонецФункции // ()

Процедура ОтправитьПисьмо(Кому, Тема, Текст)
	УчетнаяЗапись = Справочники.УчетныеЗаписиЭлектроннойПочты.СистемнаяУчетнаяЗаписьЭлектроннойПочты;
	Письмо = Новый ИнтернетПочтовоеСообщение;
	Письмо.Тема = Тема;

	Если ТипЗнч(Кому) = Тип("Строка") Тогда
		Кому = ОбщегоНазначенияКлиентСервер.РазобратьСтрокуСПочтовымиАдресами(Кому);
	КонецЕсли;

	// Формируем адрес получателя.
	Для Каждого ПочтовыйАдресПолучателя Из Кому Цикл
		Получатель = Письмо.Получатели.Добавить(ПочтовыйАдресПолучателя.Адрес);
		Получатель.ОтображаемоеИмя = ПочтовыйАдресПолучателя.Представление;
	КонецЦикла;
	
	// Добавляем к письму имя отправителя.
	Письмо.ИмяОтправителя              = УчетнаяЗапись.ИмяПользователя;
	Письмо.Отправитель.ОтображаемоеИмя = УчетнаяЗапись.ИмяПользователя;
	Письмо.Отправитель.Адрес           = УчетнаяЗапись.АдресЭлектроннойПочты;

	// добавляем текст
	Текст = Письмо.Тексты.Добавить(Текст);
	Текст.ТипТекста = ТипТекстаПочтовогоСообщения.ПростойТекст;
	
	ОбрабатыватьТекстСообщения =  ОбработкаТекстаИнтернетПочтовогоСообщения.Обрабатывать;

	Профиль = ИнтернетПочтовыйПрофиль(УчетнаяЗапись);
	Соединение = Новый ИнтернетПочта;
	Соединение.Подключиться(Профиль);	
	Соединение.Послать(Письмо, ОбрабатыватьТекстСообщения, ПротоколИнтернетПочты.SMTP);	
КонецПроцедуры
 							
// Создает профиль переданной учетной записи для подключения к почтовому серверу.
//
// Параметры:
//  УчетнаяЗапись - СправочникСсылка.УчетныеЗаписиЭлектроннойПочты - учетная запись.
//
// Возвращаемое значение:
//  ИнтернетПочтовыйПрофиль - профиль учетной записи;
//  Неопределено - не удалось получить учетную запись по ссылке.
//
Функция ИнтернетПочтовыйПрофиль(УчетнаяЗапись, ДляПолучения = Ложь)
	
	ТекстЗапроса =
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	УчетныеЗаписиЭлектроннойПочты.СерверВходящейПочты КАК АдресСервераIMAP,
	|	УчетныеЗаписиЭлектроннойПочты.ПортСервераВходящейПочты КАК ПортIMAP,
	|	УчетныеЗаписиЭлектроннойПочты.ИспользоватьЗащищенноеСоединениеДляВходящейПочты КАК ИспользоватьSSLIMAP,
	|	УчетныеЗаписиЭлектроннойПочты.Пользователь КАК ПользовательIMAP,
	|	УчетныеЗаписиЭлектроннойПочты.ИспользоватьБезопасныйВходНаСерверВходящейПочты КАК ТолькоЗащищеннаяАутентификацияIMAP,
	|	УчетныеЗаписиЭлектроннойПочты.СерверВходящейПочты КАК АдресСервераPOP3,
	|	УчетныеЗаписиЭлектроннойПочты.ПортСервераВходящейПочты КАК ПортPOP3,
	|	УчетныеЗаписиЭлектроннойПочты.ИспользоватьЗащищенноеСоединениеДляВходящейПочты КАК ИспользоватьSSLPOP3,
	|	УчетныеЗаписиЭлектроннойПочты.Пользователь КАК Пользователь,
	|	УчетныеЗаписиЭлектроннойПочты.ИспользоватьБезопасныйВходНаСерверВходящейПочты КАК ТолькоЗащищеннаяАутентификацияPOP3,
	|	УчетныеЗаписиЭлектроннойПочты.СерверИсходящейПочты КАК АдресСервераSMTP,
	|	УчетныеЗаписиЭлектроннойПочты.ПортСервераИсходящейПочты КАК ПортSMTP,
	|	УчетныеЗаписиЭлектроннойПочты.ИспользоватьЗащищенноеСоединениеДляИсходящейПочты КАК ИспользоватьSSLSMTP,
	|	УчетныеЗаписиЭлектроннойПочты.ТребуетсяВходНаСерверПередОтправкой КАК POP3ПередSMTP,
	|	УчетныеЗаписиЭлектроннойПочты.ПользовательSMTP КАК ПользовательSMTP,
	|	УчетныеЗаписиЭлектроннойПочты.ИспользоватьБезопасныйВходНаСерверИсходящейПочты КАК ТолькоЗащищеннаяАутентификацияSMTP,
	|	УчетныеЗаписиЭлектроннойПочты.ВремяОжидания КАК Таймаут,
	|	УчетныеЗаписиЭлектроннойПочты.ПротоколВходящейПочты КАК Протокол
	|ИЗ
	|	Справочник.УчетныеЗаписиЭлектроннойПочты КАК УчетныеЗаписиЭлектроннойПочты
	|ГДЕ
	|	УчетныеЗаписиЭлектроннойПочты.Ссылка = &Ссылка";
	
	Запрос = Новый Запрос(ТекстЗапроса);
	Запрос.УстановитьПараметр("Ссылка", УчетнаяЗапись);
	Выборка = Запрос.Выполнить().Выбрать();
	
	Результат = Неопределено;
	Если Выборка.Следующий() Тогда
		СписокСвойствIMAP = "АдресСервераIMAP,ПортIMAP,ИспользоватьSSLIMAP,ПользовательIMAP,ТолькоЗащищеннаяАутентификацияIMAP";
		СписокСвойствPOP3 = "АдресСервераPOP3,ПортPOP3,ИспользоватьSSLPOP3,Пользователь,ТолькоЗащищеннаяАутентификацияPOP3";
		СписокСвойствSMTP = "АдресСервераSMTP,ПортSMTP,ИспользоватьSSLSMTP,ПользовательSMTP,ТолькоЗащищеннаяАутентификацияSMTP";
		
		УстановитьПривилегированныйРежим(Истина);
		Пароли = ОбщегоНазначения.ПрочитатьДанныеИзБезопасногоХранилища(УчетнаяЗапись, "Пароль,ПарольSMTP");
		УстановитьПривилегированныйРежим(Ложь);
		
		Результат = Новый ИнтернетПочтовыйПрофиль;
		Если ДляПолучения Тогда
			Если Выборка.Протокол = "IMAP" Тогда
				ТребуемыеСвойства = СписокСвойствIMAP;
				Результат.ПарольIMAP = Пароли.Пароль;
			Иначе
				ТребуемыеСвойства = СписокСвойствPOP3;
				Результат.Пароль = Пароли.Пароль;
			КонецЕсли;
		Иначе
			ТребуемыеСвойства = СписокСвойствSMTP;
			Результат.ПарольSMTP = Пароли.ПарольSMTP;
			Если Выборка.Протокол <> "IMAP" И Выборка.POP3ПередSMTP Тогда
				ТребуемыеСвойства = ТребуемыеСвойства + ",POP3ПередSMTP," + СписокСвойствPOP3;
				Результат.Пароль = Пароли.Пароль;
			КонецЕсли;
			Если Выборка.Протокол = "IMAP" Тогда
				ТребуемыеСвойства = ТребуемыеСвойства + "," + СписокСвойствIMAP;
				Результат.ПарольIMAP =Пароли.Пароль;
			КонецЕсли;
		КонецЕсли;
		ТребуемыеСвойства = ТребуемыеСвойства + ",Таймаут";
		ЗаполнитьЗначенияСвойств(Результат, Выборка, ТребуемыеСвойства);
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции
 
Функция ПолучитьАдресЭПизПользователя(Пользователь)
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	ПользователиКонтактнаяИнформация.Представление КАК АдресЭП
	               |ИЗ
	               |	Справочник.Пользователи.КонтактнаяИнформация КАК ПользователиКонтактнаяИнформация
	               |ГДЕ
	               |	ПользователиКонтактнаяИнформация.Ссылка = &Ссылка
	               |	И ПользователиКонтактнаяИнформация.Тип = &Тип
	               |	И ПользователиКонтактнаяИнформация.Вид = &Вид";
	Запрос.УстановитьПараметр("Ссылка", Пользователь);
	Запрос.УстановитьПараметр("Тип", Перечисления.ТипыКонтактнойИнформации.АдресЭлектроннойПочты);
	Запрос.УстановитьПараметр("Вид", Справочники.ВидыКонтактнойИнформации.EmailПользователя);
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		Возврат Выборка.АдресЭП;
	Иначе
		Возврат "";
	КонецЕсли; 
КонецФункции // ()

Функция ПолучитьМассивКодовВГруппе(Группа)
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	СМ_Ресурсы.Код КАК Код
	               |ИЗ
	               |	Справочник.СМ_Ресурсы КАК СМ_Ресурсы
	               |ГДЕ
	               |	СМ_Ресурсы.Ссылка В ИЕРАРХИИ(&Группа)
	               |	И СМ_Ресурсы.Код ПОДОБНО &Код";
	Запрос.УстановитьПараметр("Код", Группа.Код + "-%");
	Запрос.УстановитьПараметр("Группа", Группа);
	Возврат Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Код");
КонецФункции // ()

Процедура ОбработкаВыбораМатериалаНаСервере(ВыбранныйМатериал)
	Если ТипЗнч(ВыбранныйМатериал) = Тип("Массив") Тогда
		Если ВыбранныйМатериал.Количество() > 0  Тогда
			ВыбранныйМатериалСсылка = ВыбранныйМатериал[0];
			Если ТипЗнч(ВыбранныйМатериалСсылка) = Тип("СправочникСсылка.СМ_Ресурсы") Тогда
				Если Объект.Материалы.Количество() = 1 Тогда
					ТекСтрокаМатериалы = Объект.Материалы[0];
					ТекСтрокаМатериалы.Наименование = ВыбранныйМатериалСсылка;
					ТекСтрокаМатериалы.ПолноеНаименование = ТекСтрокаМатериалы.Наименование.ДлинноеНаименование;
					ТекСтрокаМатериалы.ЕдиницаИзмерения = ТекСтрокаМатериалы.Наименование.ЕдиницаИзмерения;
					ТекСтрокаМатериалы.Группа = ТекСтрокаМатериалы.Наименование.Родитель;
					ТекСтрокаМатериалы.Код = ТекСтрокаМатериалы.Наименование.Код;
					ЭтаФорма.Модифицированность = Истина;
				КонецЕсли; 
			КонецЕсли; 
		КонецЕсли;
	ИначеЕсли ВыбранныйМатериал = "ОчиститьСсылку" Тогда
		Объект.Материалы[0].Наименование = Справочники.СМ_Ресурсы.ПустаяСсылка();
		ЭтаФорма.Модифицированность = Истина;
	КонецЕсли;
КонецПроцедуры

#КонецОбласти
